{"status":"ok","totalResults":10,"articles":[{"source":{"id":"google-news","name":"Google News"},"author":"Doha Madani, Maggie Fox","title":"Don't eat romaine lettuce, CDC cautions after E. coli outbreak","description":"The CDC has advised consumers to stay away from romaine lettuce because of an outbreak of E. coli that has sickened 32 people.","url":"https://www.nbcnews.com/health/health-news/e-coli-fears-leads-cdc-tell-people-stay-away-romaine-n938606","urlToImage":"https://media4.s-nbcnews.com/j/newscms/2018_26/2406321/180420-romaine-lettuce-ac-526p_982e227627e157407f77f75564027aad.1200;630;7;70;5.jpg","publishedAt":"2018-11-20T20:12:00+00:00","content":"Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings. SUBSCRIBE Nov. 20, 2018 / 8:12 PM GMT Federal health officials are warning about a fresh outbreak of E.coli linked to romaine lettuce Tuesday and cauti… [+2497 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":"https://www.washingtonexaminer.com/author/tom-rogan","title":"Trump's mealy-mouthed statement on the Jamal Khashoggi murder is actually prudent","description":"President Trump was right to make a deliberately blurry finding on Saudi Crown Prince Mohammed bin Salman's culpability for the Oct. 2 murder of Saudi dissident, Jamal Khashoggi at the Saudi consulate in Istanbul, Turkey.","url":"https://www.washingtonexaminer.com/opinion/trumps-mealy-mouthed-statement-on-the-jamal-khashoggi-murder-is-actually-prudent","urlToImage":"https://mediadc.brightspotcdn.com/dims4/default/ee44c38/2147483647/strip/true/crop/2290x1202+0+0/resize/1200x630!/quality/90/?url=https%3A%2F%2Fmediadc.brightspotcdn.com%2Fe6%2F7f%2Fd36abbe9409d9e0458537f13bd05%2Ftrump-jamal-khashoggi.jpg","publishedAt":"2018-11-20T18:18:00+00:00","content":"P resident Trump was right to make a deliberately blurry finding on Saudi Crown Prince Mohammed bin Salman's culpability for the Oct. 2 murder of Saudi dissident, Jamal Khashoggi at the Saudi consulate in Istanbul, Turkey. \"It could very well be that the crow… [+2593 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":"Todd Wallack - Reporter","title":"Prosecutors blame serial rapist for 1969 murder of Harvard student Jane Britton - The Boston Globe","description":"After conducting fresh DNA testing and analysis, Middlesex County prosecutors announced Tuesday they have at last identified Britton’s killer.","url":"https://www.bostonglobe.com/metro/2018/11/20/after-almost-years-prosecutors-blame-serial-rapist-for-unsolved-murder-harvard-student-jane-britton/RSPc7JJQcCcGjW3nVVc7lJ/story.html","urlToImage":"https://www.bostonglobe.com/rf/image_585w/Boston/2011-2020/2018/11/20/BostonGlobe.com/Spotlight/Images/harvard1.jpg","publishedAt":"2018-11-20T18:15:00+00:00","content":"For years, amateur investigators speculated about who might have killed Jane Britton, a popular Harvard University graduate student found bludgeoned to death in her Cambridge apartment in 1969. People sent theories to police. They gossiped about the case on I… [+6198 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":"","title":"Italy Wants Rescue Ship Seized, Accuses Doctors Without Borders Of Illegal Dumping","description":"Doctors Without Borders, which operates the Aquarius, \"strongly condemns\" the request and says allegations of improperly disposed medical and other waste are \"unfounded and sinister.\"","url":"https://www.npr.org/2018/11/20/669596607/italy-wants-rescue-ship-seized-accuses-doctors-without-borders-of-illegal-dumpin","urlToImage":"https://media.npr.org/assets/img/2018/11/20/gettyimages-1009032256_wide-74821f0d3919c20025a1ed51034176028af35767.jpg?s=1400","publishedAt":"2018-11-20T18:12:00+00:00","content":"The rescue ship Aquarius, chartered by aid groups SOS Mediterranee and Doctors Without Borders, leaves the harbor of Marseille, France, on Aug. 1. The ship has been docked at Marseille since September, when it lost its registration, and Italian authorities ar… [+4780 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":"https://www.washingtonexaminer.com/author/tom-rogan","title":"3 big distinctions between Ivanka Trump and Hillary Clinton's email conduct","description":"Ivanka Trump's use of a Trump Organization personal email account to conduct White House business was ill-advised and against federal records rules. But it is utterly absurd to suggest, as many are doing, that Ivanka Trump's conduct here is similar to Hillary…","url":"https://www.washingtonexaminer.com/opinion/3-big-distinctions-between-ivanka-trump-and-hillary-clintons-email-conduct","urlToImage":"https://mediadc.brightspotcdn.com/dims4/default/a6f89b1/2147483647/strip/true/crop/2290x1202+0+0/resize/1200x630!/quality/90/?url=https%3A%2F%2Fmediadc.brightspotcdn.com%2F38%2Ffb%2Fc5df6a264ddcbd2c5e2b4cd031fb%2Fivanka-trump-and-hillary-clinton-112018.jpg","publishedAt":"2018-11-20T17:26:00+00:00","content":"I vanka Trump's use of a Trump Organization personal email account to conduct White House business was ill-advised and against federal records rules. But it is utterly absurd to suggest, as many are doing, that Ivanka Trump's conduct here is similar to Hillar… [+3028 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":null,"title":"Green Tuesday: Crowds line up at 1st Massachusetts pot shops","description":"LEICESTER, Mass. — More than two years after voters in Massachusetts approved of recreational marijuana for adults, there are finally places","url":"https://www.theday.com/article/20181120/NWS12/181129978","urlToImage":"https://www.theday.com/storyimage/NL/20181120/NWS12/181129978/AR/0/AR-181129978.jpg&imageversion=16by9&Maxw=960","publishedAt":"2018-11-20T14:25:19+00:00","content":"LEICESTER, Mass. — More than two years after voters in Massachusetts approved of recreational marijuana for adults, there are finally places to buy it legally. The state's first commercial pot shops opened Tuesday in Leicester and Northampton. The stores are … [+521 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":"Edmund DeMarche","title":"Judge bars US from enforcing Trump administration’s asylum ban","description":"A federal judge in San Francisco on Monday barred the Trump administration from refusing asylum to immigrants who cross the southern border illegally, likely prompting a legal challenge from the White House.","url":"https://www.foxnews.com/politics/judge-bars-us-from-enforcing-trump-administrations-asylum-ban","urlToImage":"https://media2.foxnews.com/BrightCove/694940094001/2018/11/15/694940094001_5967525182001_5967521916001-vs.jpg","publishedAt":"2018-11-20T10:26:32+00:00","content":"A federal judge in San Francisco on Monday barred the Trump administration from refusing asylum to immigrants who cross the southern border illegally, likely prompting a legal challenge from the White House. Trump issued a proclamation on Nov. 9 that said any… [+2972 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":"https://www.washingtonexaminer.com/author/erin-dunne","title":"On Thanksgiving, Trump should pardon more than turkeys","description":"On Twitter you can vote for which turkey Trump should pardon: Peas or Carrots. But once he is done presiding over the pardoning of feathery Thanksgiving centerpieces, both of which are guaranteed life on a farm anyway, the president should turn his attention …","url":"https://www.washingtonexaminer.com/opinion/on-thanksgiving-trump-should-pardon-more-than-turkeys","urlToImage":"https://mediadc.brightspotcdn.com/dims4/default/3396399/2147483647/strip/true/crop/1060x557+0+22/resize/1200x630!/quality/90/?url=https%3A%2F%2Fmediadc.brightspotcdn.com%2F46%2Ff1%2F3cdb954a4d4a93a1e42925a4e88c%2Fap-18322780445822.jpg","publishedAt":"2018-11-19T23:16:00+00:00","content":"O n Twitter you can vote for which turkey Trump should pardon: Peas or Carrots. But once he is done presiding over the pardoning of feathery Thanksgiving centerpieces, both of which are guaranteed life on a farm anyway, the president should turn his attention… [+2433 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":"https://www.washingtonexaminer.com/author/leonard-goodman","title":"I don't support Trump, but don't rely on sketchy Robert Mueller to boot him from office","description":"I am not a Trump supporter, but a hard-core leftie who supported Green and Justice Party candidates in the past two presidential elections. Yet I stand with supporters of President Trump in their distrust of special counsel Robert Mueller's investigation.","url":"https://www.washingtonexaminer.com/opinion/op-eds/i-dont-support-trump-but-dont-rely-on-sketchy-robert-mueller-to-boot-him-from-office","urlToImage":"https://mediadc.brightspotcdn.com/dims4/default/c0231f6/2147483647/strip/true/crop/2290x1202+0+0/resize/1200x630!/quality/90/?url=https%3A%2F%2Fmediadc.brightspotcdn.com%2Fe1%2Ff9%2F2ed3d06b440c8a2dcf3ed4c409d7%2F314761948-1-8.jpg","publishedAt":"2018-11-19T21:19:00+00:00","content":"I am not a Trump supporter, but a hard-core leftie who supported Green and Justice Party candidates in the past two presidential elections. Yet I stand with supporters of President Trump in their distrust of special counsel Robert Mueller's investigation. We … [+3790 chars]"},{"source":{"id":"google-news","name":"Google News"},"author":null,"title":"Former FBI Deputy Director Buck Revell: Don’t hand over Interpol to Russia","description":"Imagine putting a key international law enforcement agency in the hands of one of the top international law abusers.","url":"https://www.foxnews.com/opinion/buck-revell-dont-hand-over-interpol-to-russia","urlToImage":"https://static.foxnews.com/foxnews.com/content/uploads/2018/10/7b8226d4-ContentBroker_contentid-c279025fcd91483d89d70838502e9e95.png","publishedAt":"2018-11-19T21:18:17+00:00","content":"Imagine putting a key international law enforcement agency in the hands of one of the top international law abusers. Unless the United States and others act, this Wednesday, November 21, exactly that will happen, as the presidency of Interpol will be turned o… [+4100 chars]"}]}